using System;
using System.Collections;
using System.Collections.Generic;
using System.IO;
using System.Linq;
using System.Text;
using Ivony.Data;
using System.Web.Http.ModelBinding;
using System.Web.Http;
using System.Web.Http.Controllers;
using System.Threading.Tasks;
using System.Runtime.CompilerServices;
using System.Threading;
using System.Runtime.Remoting.Messaging;
using System.Text.RegularExpressions;

namespace Ivony.TableGame.WebHost
{


  /// <summary>
  /// 玩家宿主，登陆用户在系统中的宿主对象
  /// </summary>
  public partial class PlayerHost : IPlayerHost
  {


    public Guid Guid
    {
      get;
      private set;
    }



    private PlayerHost( Guid id, string name )
    {
      Guid = id;
      Name = name;

      SyncRoot = new object();
      _console = new PlayerConsole( this );
    }


    private static readonly string[] lastNames = new[] { "安", "艾", "爱", "阿", "哀", "昂", "敖", "巴", "白", "鲍", "包", "暴", "班", "柏", "毕", "卞", "边", "薄", "伯", "卜", "步", "贝", "贲", "邴", "别", "百里", "百", "拜", "板", "褒", "宝", "保", "卑", "北", "孛", "邶", "闭", "本", "碧", "表", "宾", "丙", "波", "帛", "不", "布", "蔡", "岑", "陈", "褚", "崔", "储", "车", "池", "从", "苍", "柴", "充", "晁", "巢", "淳于", "单于", "楚", "才", "藏", "操", "曹", "昌", "苌", "常", "畅", "抄", "钞", "潮", "谌", "称", "成", "承", "城", "乘", "程", "澄", "迟", "赤", "崇", "丑", "出", "初", "春", "慈", "次", "丛", "翠", "寸", "蹉", "错", "笪", "戴", "狄", "窦", "东", "董", "杜", "刁", "丁", "邓", "段", "党", "堵", "都", "东方", "端木", "段干", "东郭", "东门", "第五", "达", "答", "大", "逮", "代", "丹", "郸", "但", "淡", "刀", "道", "德", "登", "邸", "第", "典", "定", "栋", "豆", "督", "独", "笃", "度", "端", "顿", "多", "铎", "鄂", "尔", "贰", "法", "费", "樊", "方", "封", "酆", "冯", "费", "房", "傅", "伏", "福", "扶", "富", "藩", "繁", "范", "范姜", "飞", "肥", "斐", "丰", "风", "逢", "凤", "奉", "佛", "夫", "浮", "符", "甫", "府", "富察", "盖", "甘", "干", "高", "郜", "戈", "葛", "耿", "谷", "古", "顾", "郭", "国", "归", "桂", "勾", "缑", "关", "管", "广", "公", "弓", "龚", "宫", "巩", "贡", "公孙", "公西", "公羊", "公冶", "公良", "榖梁", "改", "淦", "刚", "皋", "告", "革", "庚", "公叔", "功", "恭", "拱", "贡", "苟", "辜", "谷梁", "瓜尔佳", "官", "贯", "冠", "光", "圭", "妫", "贵", "虢", "果", "过", "哈", "海", "郝", "韩", "杭", "何", "和", "贺", "衡", "滑", "桓", "怀", "胡", "扈", "宦", "黄", "侯", "后", "洪", "弘", "红", "霍", "赫连", "皇甫", "呼延", "亥", "邗", "函", "寒", "罕", "汉", "汗", "行", "蒿", "禾", "合", "盍", "赫", "赫舍里", "闳", "宏", "后", "厚", "候", "呼", "斛", "虎", "户", "花", "华", "化", "环", "皇", "辉", "回", "惠", "荤", "浑", "嵇", "姬", "吉", "汲", "籍", "季", "计", "纪", "蓟", "冀", "暨", "金", "靳", "姬", "家", "郏", "贾", "简", "焦", "姜", "江", "蒋", "晋", "经", "荆", "井", "景", "鞠", "居", "夹谷", "机", "箕", "稽", "及", "戢", "集", "己", "祭", "嘉", "甲", "坚", "菅", "检", "翦", "蹇", "謇", "建", "剑", "谏", "将", "佼", "矫", "接", "揭", "节", "捷", "竭", "介", "进", "京", "敬", "靖", "镜", "九", "酒", "咎", "驹", "局", "巨", "剧", "卷", "军", "隽", "寇", "孔", "康", "柯", "蒯", "隗", "夔", "匡", "阚", "空", "况", "开", "亢", "抗", "考", "可", "苦", "库", "库雅喇", "狂", "邝", "旷", "蒉", "李", "郎", "鲁", "柳", "雷", "蓝", "路", "娄", "林", "栾", "厉", "刘", "黎", "吕", "梁", "廉", "鲁", "骆", "罗", "凌", "卢", "陆", "栾", "龙", "赖", "劳", "郦", "蔺", "连", "廖", "禄", "利", "隆", "冷", "逯", "令狐", "闾丘", "梁丘", "马", "满", "苗", "母", "穆", "毛", "明", "茅", "麻", "蒙", "孟", "糜", "米", "宓", "梅", "莫", "墨", "牟", "缪", "牧", "慕", "闵", "俟", "慕容", "那", "能", "佴", "倪", "年", "宁", "乜", "聂", "钮", "牛", "农", "南门", "南宫", "欧", "欧阳", "潘", "庞", "逄", "裴", "彭", "蓬", "平", "蒲", "潘", "濮", "浦", "濮阳", "戚", "齐", "祁", "乔", "谯", "强", "屈", "邱", "璩", "瞿", "钱", "璩", "全", "秦", "钦", "琴", "权", "亓官", "漆雕", "邱", "秋", "裘", "仇", "曲", "全", "阙", "冉", "饶", "壤驷", "任", "阮", "荣", "容", "芮", "戎", "融", "茹", "汝", "桑", "司", "商", "宋", "松", "舒", "水", "苏", "宿", "孙", "索", "沈", "沙", "邵", "施", "师", "石", "史", "时", "厍", "束", "殳", "盛", "单", "山", "商", "尚", "双", "韶", "莘", "申", "慎", "寿", "司马", "上官", "申屠", "司徒", "赏", "邰", "谭", "谈", "陶", "唐", "汤", "滕", "田", "童", "通", "佟", "钭", "屠", "涂", "太叔", "澹台", "拓跋", "万", "邬", "巫", "乌", "吴", "伍", "武", "汪", "王", "危", "微", "韦", "卫", "魏", "蔚", "温", "闻", "文", "翁", "沃", "闻人", "巫马", "奚", "阎", "席", "习", "郤", "夏", "宣", "熊", "项", "须", "胥", "徐", "许", "薛", "荀", "谢", "解", "辛", "邢", "幸", "向", "相", "夏侯", "轩辕", "鲜于", "西门", "夕", "希", "昔", "析", "郗", "悉", "袭", "喜", "喜塔腊", "戏", "系", "仙", "鲜", "咸", "冼", "线", "香", "象", "肖", "萧", "孝", "校", "忻", "信", "衅", "星", "刑", "兴", "性", "姓", "休", "修", "绪", "续", "玄", "学", "雪", "寻", "燕", "鄢", "颜", "言", "闫", "阎", "严", "晏", "姚", "羊", "杨", "阳", "养", "仰", "叶", "云", "俞", "袁", "於", "于", "鱼", "虞", "余", "庾", "郁", "喻", "鬱", "乐", "岳", "越", "元", "伊", "易", "羿", "益", "阴", "殷", "尹", "印", "应", "尤", "游", "有", "雍", "尉迟", "宇文", "乐正", "羊舌", "烟", "焉", "延", "扬", "洋", "尧", "徭", "野", "业", "叶赫那拉", "叶赫那兰", "衣", "依", "依尔根觉罗", "依尔觉罗", "仪", "夷", "宜", "乙", "以", "蚁", "义", "奕", "裔", "银", "鄞", "隐", "英", "盈", "营", "嬴", "永", "勇", "用", "由", "犹", "友", "愚", "宇", "羽", "禹", "玉", "郁", "遇", "御", "愈", "毓", "僪", "员", "原", "源", "苑", "允", "运", "恽", "宰", "昝", "查", "翟", "詹", "湛", "张", "章", "赵", "訾", "支", "甄", "曾", "周", "邹", "郑", "朱", "诸", "竺", "祝", "臧", "宗", "钟", "终", "仲", "祖", "左", "卓", "庄", "诸葛", "宗政", "仲孙", "钟离", "长孙", "仉督", "子车", "颛孙", "宰父", "左丘", "载", "在", "迮", "斋", "粘", "展", "占", "战", "张简", "张廖", "章佳", "长", "仉", "掌", "钊", "招", "召", "兆", "肇", "折", "针", "真", "镇", "之", "枝", "植", "止", "智", "中", "衷", "锺", "锺离", "种", "竹", "禚", "濯", "资", "紫", "字", "纵", "俎" };
    private static readonly string[] firstNames = new[] { "一", "乙", "乃", "了", "力", "丁", "刀", "刁", "二", "又", "人", "入", "七", "十", "几", "口", "干", "工", "弓", "久", "己", "土", "大", "丈", "女", "己", "巾", "勺", "丸", "也", "于", "弋", "巳", "兀", "三", "下", "上", "乞", "士", "夕", "千", "子", "寸", "小", "山", "川", "巳", "才", "凡", "公", "孔", "亢", "勾", "中", "之", "丹", "井", "介", "今", "内", "及", "太", "天", "屯", "斗", "斤", "牛", "丑", "支", "允", "元", "勿", "午", "友", "尤", "尹", "引", "文", "月", "日", "牙", "王", "云", "匀", "牛", "四", "丑", "仁", "什", "切", "升", "收", "壬", "少", "心", "手", "日", "氏", "水", "尤", "仍", "双", "尺", "仇", "止", "才", "不", "互", "分", "匹", "化", "卡", "卞", "肥", "反", "夫", "巴", "幻", "户", "方", "木", "比", "毛", "仆", "丰", "火", "片", "古", "切", "可", "瓜", "甘", "刊", "五", "丘", "加", "去", "句", "叫", "外", "巧", "巨", "玉", "甲", "令", "加", "占", "主", "巨", "冬", "他", "代", "只", "仗", "另", "句", "召", "尼", "正", "田", "旦", "奴", "凸", "立", "叮", "仝", "伏", "台", "奶", "凹", "五", "外", "央", "右", "未", "永", "以", "戊", "玉", "瓦", "由", "幼", "仕", "巧", "丘", "仙", "兄", "司", "且", "史", "左", "世", "出", "市", "玄", "仔", "冉", "穴", "示", "生", "申", "充", "主", "仞", "仟", "册", "加", "去", "只", "叫", "求", "正", "甲", "申", "石", "匝", "甩", "丙", "平", "母", "弘", "末", "包", "本", "弗", "北", "必", "丕", "半", "布", "皿", "目", "乏", "禾", "皮", "疋", "矛", "乎", "付", "兄", "卉", "戊", "民", "冰", "玄", "白", "卯", "伉", "光", "匡", "共", "各", "考", "交", "件", "价", "企", "伍", "伎", "仰", "吉", "圭", "曲", "机", "艮", "六", "仲", "吉", "州", "朱", "兆", "决", "匠", "地", "旨", "朵", "吏", "列", "年", "劣", "同", "打", "汀", "至", "臼", "灯", "竹", "老", "舟", "伎", "吊", "吏", "圳", "的", "宅", "机", "老", "肉", "虫", "伊", "仰", "伍", "印", "因", "宇", "安", "屹", "有", "羊", "而", "耳", "衣", "亦", "吃", "夷", "奸", "聿", "丞", "企", "休", "任", "先", "全", "再", "冲", "刑", "向", "在", "夙", "如", "宅", "守", "字", "存", "寺", "式", "戌", "收", "早", "旭", "旬", "曲", "次", "此", "求", "系", "肉", "臣", "自", "舌", "血", "行", "圳", "西", "休", "交", "件", "企", "匠", "吉", "尖", "而", "至", "色", "伏", "后", "名", "回", "好", "妃", "帆", "灰", "牟", "百", "份米", "伐", "亥", "卉", "冰", "刑", "合", "向", "旭", "朴", "系", "行", "汜", "复", "克", "告", "改", "攻", "更", "杆", "谷", "况", "伽", "估", "君", "吴", "吸", "吾", "圻", "均", "坎", "研", "完", "局", "岐", "我", "扣", "杞", "江", "究", "见", "角", "言", "住", "占", "低", "佃", "况", "里", "冷", "伶", "利", "助", "努", "君", "吝", "昌", "壮", "妓", "妞", "局", "弄", "廷", "弟", "彤", "志", "托", "杖", "杜", "呆", "李", "江", "男", "究", "良", "见", "角", "具", "皂", "里", "舟", "佟", "你", "体", "足", "甸", "町", "豆", "吞", "玎", "位", "佐", "佘", "冶", "吾", "吟", "吴", "吻", "完", "尾", "巫", "役", "忘", "我", "修", "言", "邑", "酉", "吟", "吴", "研", "呆", "角", "七", "伸", "佐", "作", "些", "伽", "些", "初", "吹", "呈", "坐", "孝", "宋", "岐", "希", "岑", "床", "序", "巡", "形", "忍", "成", "杏", "材", "杉", "束", "村", "杞", "步", "汝", "汐", "池", "私", "秀", "赤", "足", "身", "车", "辰", "系", "占", "伺", "住", "余", "助", "劭", "劬", "邵", "吸", "坐", "壮", "妆", "局", "床", "志", "汕", "江", "灶", "见", "即", "却", "克", "早", "何", "布", "伯", "伴", "佛", "兵", "判", "别", "含", "坊", "坂", "吵", "宏", "旱", "每", "甫", "牡", "况", "免", "孚", "孝", "尾", "巫", "希", "庇", "形", "忙", "杏", "呆", "步", "汛", "贝", "儿", "供", "侃", "刻", "卦", "固", "坤", "姑", "官", "冈", "庚", "快", "抗", "昆", "果", "空", "亟", "其", "具", "券", "卷", "奇", "委", "季", "宜", "居", "届", "岢", "岸", "杰", "佳", "京", "侄", "佳", "来", "例", "制", "到", "兔", "两", "典", "卷", "周", "呢", "坦", "奈", "妮", "宙", "定", "居", "屉", "帖", "底", "店", "征", "忝", "忠", "念", "技", "投", "政", "枝", "东", "林", "汰", "决", "玖", "知", "的", "直", "纠", "金", "两", "乳", "侏", "佰", "侗", "佻", "佬", "具", "冽", "卓", "拈", "妲", "妯", "宕", "岱", "岭", "帖", "帙", "底", "抒", "林", "杼", "沓", "炉", "竺", "长", "依", "侑", "味", "夜", "委", "宜", "宛", "岳", "岸", "岩", "往", "亚", "武", "於", "易", "昂", "旺", "沅", "沃", "汪", "物", "艾", "卧", "佯", "儿", "咏", "抑", "昀", "炎", "杳", "事", "享", "侍", "使", "侈", "然", "刹", "刺", "协", "卒", "洽", "沁", "取", "受", "步", "垂", "奇", "始", "炊", "姓", "妻", "妾", "尚", "屈", "弦", "所", "承", "昌", "升", "昔", "松", "欣", "沙", "沈", "社", "舍", "炊", "采", "长", "青", "幸", "亟", "徇", "佳", "舍", "儿", "争", "其", "刷", "券", "制", "效", "卷", "姐", "姒", "姗", "季", "炙", "宗", "届", "岫", "征", "承", "昔", "析", "枕", "状", "八", "并", "佩", "函", "和", "命", "坡", "坪", "奉", "孟", "帛", "水", "府", "佛", "彼", "忽", "或", "戽", "房", "扮", "枇", "扶", "放", "昏", "朋", "服", "明", "杭", "杯", "枚", "板", "沛", "沐", "汾", "版", "牧", "虎", "门", "阜", "杷", "盲", "非", "冠", "奎", "皈", "客", "故", "柑", "柯", "况", "看", "科", "肝", "革", "屋", "癸", "砍", "禹", "轨", "页", "九", "亭", "亮", "柱", "俊", "侣", "冒", "段", "劲", "南", "姬", "姜", "姣", "宦", "帝", "度", "痔", "建", "峙", "待", "律", "怠", "急", "招", "拒", "拓", "拙", "拉", "昭", "架", "柱", "柳", "注", "治", "炭", "界", "皆", "突", "纪", "纣", "耐", "肚", "致", "计", "订", "军", "酊", "俐", "胃", "百", "厘", "咨", "姝", "姿", "柁", "沱", "炭", "妆", "纣", "重", "珏", "盅", "眈", "俄", "俞", "勇", "威", "娃", "姻", "姚", "姨", "屋", "幽", "彦", "奕", "哀", "哇", "玟", "怡", "押", "映", "昱", "韦", "油", "泳", "沿", "姚", "畏", "烟", "盈", "禹", "约", "耶", "衍", "要", "页", "音", "昱", "柚", "胤", "易", "信", "侠", "系", "俗", "促", "俏", "前", "则", "奏", "型", "姹", "妊", "姝", "姿", "室", "宣", "巷", "咱", "哉", "思", "性", "施", "昨", "是", "春", "星", "查", "柴", "栅", "柔", "染", "泉", "帅", "甚", "相", "省", "砂", "祈", "秋", "穿", "肖", "重", "首", "酉", "食", "香", "侵", "俟", "峙", "旭", "注", "沐", "炷", "祉", "贞", "昌", "泓", "侯", "保", "便", "冒", "勉", "匍", "奔", "品", "佩", "杯", "封", "哈", "皇", "拔", "抱", "怕", "柏", "柄", "泌", "法", "泡", "炳", "玫", "盆", "眉", "红", "美", "虹", "秒", "表", "负", "面", "风", "飞", "眄", "胃", "勃", "厚", "咸", "叛", "孩", "奂", "屏", "枰", "某", "河", "泛", "赴", "库", "恭", "拱", "格", "桂", "根", "耕", "耿", "股", "肯", "贡", "高", "个", "刚", "哥", "宫", "径", "挂", "皋", "径", "徒", "倜", "恬", "拯", "指", "拿", "料", "旅", "晋", "朕", "桌", "桔", "桃", "桐", "洞", "流", "洛", "酒", "烈", "特", "玲", "珍", "真", "矩", "祝", "秩", "租", "站", "级", "纸", "纳", "纽", "者", "肩", "芝", "记", "讨", "酌", "酒", "针", "钉", "只", "挑", "借", "倒", "值", "俱", "倪", "倘", "伦", "兼", "唐", "哲", "娘", "旃", "娟", "娜", "展", "峻", "准", "凌", "洲", "套", "爹", "特", "留", "俩", "倜", "庭", "恫", "耻", "烙", "料", "栗", "株", "津", "玳", "畜", "砧", "恩", "按", "案", "鸟", "洋", "秧", "翁", "纹", "耘", "育", "芽", "芸", "蚊", "袁", "烟", "倚", "原", "员", "埃", "宴", "峨", "倚", "娱", "容", "峪", "晏", "移", "益", "差", "师", "席", "座", "徐", "恰", "息", "恕", "肩", "持", "拳", "拾", "时", "书", "曹", "校", "朔", "桑", "栽", "殊", "气", "洽", "珊", "祠", "神", "祖", "秦", "秤", "索", "素", "纱", "纾", "纯", "虔", "讫", "训", "财", "起", "轩", "芩", "闪", "迅", "倩", "幸", "修", "仓", "城", "夏", "孙", "宰", "容", "射", "峡", "厝", "叟", "奚", "畜", "春", "乘", "借", "准", "淞", "宵", "指", "拭", "牲", "洵", "洳", "狩", "兹", "珊", "炸", "租", "站", "宸", "挈", "旁", "晃", "桓", "活", "洪", "畔", "亩", "眠", "破", "炮", "秘", "粉", "纺", "肺", "肥", "航", "般", "芳", "芙", "花", "配", "马", "侯", "倍", "俯", "俸", "们", "圃", "埋", "娩", "峰", "肪", "涵", "畔", "埔", "害", "恢", "恍", "恒", "柏", "派", "洹", "玻", "泌", "珉", "祜", "呗", "国", "寇", "昆", "康", "苦", "袍", "规", "贯", "够", "勘", "崞", "岗", "梗", "珙", "偕", "假", "健", "停", "侦", "剪", "动", "翎", "念", "基", "坚", "堂", "堆", "婧", "寄", "专", "张", "得", "教", "救", "朗", "条", "梁", "梯", "械", "梨", "浙", "浪", "珠", "略", "皎", "眷", "窕", "竟", "第", "终", "累", "舵", "苓", "架", "诀", "近", "钓", "顶", "鸟", "将", "那", "庶", "振", "挺", "捉", "捐", "甜", "祭", "趾", "囵", "堆", "凌", "崃", "带", "帐", "徕", "悌", "画", "梁", "梃", "桶", "町", "娄", "伟", "偶", "务", "唯", "问", "婉", "寅", "尉", "帷", "庸", "悟", "悠", "悦", "敖", "晚", "梧", "浴", "眼", "研", "移", "胃", "苑", "英", "迎", "野", "鱼", "欲", "浣", "翌", "圉", "乾", "做", "区", "卿", "参", "售", "启", "商", "唱", "娶", "妇", "宿", "崇", "崎", "崔", "常", "强", "从", "悄", "叙", "旋", "晨", "晟", "族", "消", "爽", "犀", "祥", "绅", "细", "紫", "组", "绍", "婧", "羞", "习", "邢", "舷", "船", "茄", "若", "处", "术", "袖", "设", "讼", "责", "赦", "雀", "雪", "顷", "彩", "常", "孰", "侦", "匙", "圊", "执", "将", "专", "就", "峥", "崧", "巢", "庶", "彩", "悉", "施", "曹", "浙", "笙", "钏", "阡", "凰", "毫", "培", "婚", "婆", "妇", "密", "彬", "彪", "患", "斌", "曼", "海", "浩", "烽", "班", "瓶", "毕", "盒", "符", "邦", "胡", "背", "胞", "胖", "舶", "范", "茅", "苗", "袍", "被", "觅", "访", "货", "返", "贩", "闭", "麦", "麻", "邦", "壶", "票", "冕", "副", "埠", "屏", "涵", "捕", "敏", "皓", "梅", "第", "珩", "艴", "苹", "敢", "款", "淦", "筐", "给", "贵", "辜", "开", "凯", "昆", "诒", "询", "几", "蛟", "植", "堵", "堤", "奠", "岚", "帧", "掌", "掘", "捷", "掏", "掎推", "探", "接", "敦", "景", "智", "晶", "替", "朝", "椒", "棠", "栈", "殖", "淘", "添", "淡", "净", "焦", "街", "诊", "理", "荔", "眨", "贴", "屠", "贷", "轸", "迢", "迪", "迦", "量", "钧", "钮", "间", "集", "杰", "劳", "单", "婷", "喋", "传", "塘", "塔", "暖", "楠", "殿", "渡", "汤", "帏", "幄", "惟", "掩", "椅", "涯", "液", "渊", "焰", "为", "异", "砚", "围茵", "越", "阮", "轶", "雁", "雅", "寓", "云", "雯", "媛", "喻", "贻", "婺", "焱", "琬", "琰", "畲", "劳", "博", "堡", "报", "富", "寒", "嵋", "帽", "幅", "帮", "弼", "复", "彭徨", "偏", "整", "理", "惠", "扉", "排", "斑", "酣", "普", "棉", "棒", "棚", "涵", "混", "淼", "淮", "淝", "牌", "画", "番", "发", "皓", "脉", "茗", "评", "贺", "费", "买", "贸", "迫", "邯", "闵", "防", "阪", "黄", "傅", "傍", "媒", "媚", "黑", "瓿匮", "块", "干", "感", "揆", "手", "楷", "港", "琨", "莞", "夸", "鼓", "该", "贾", "传", "仅", "涂", "塔", "塘", "廊", "谦", "提", "敬", "斟", "极", "楠", "殿汤", "渡", "绢", "经", "茎", "莒", "获", "莅", "庄", "莉", "蜀", "里", "装", "解", "詹", "鼎", "贾", "路", "迹", "退", "铃", "钜", "陀", "电", "雷", "靖", "顿", "暖", "桢", "路", "嫁", "农", "贮", "贷", "贴", "轸", "迪", "钠", "湍", "琳", "当", "略", "铃", "鼓", "励", "庸", "园", "圆", "奥", "爱", "意", "扬", "援", "握", "榆", "业", "杨", "椰涌", "渝", "渭", "游", "炜", "爷", "烟", "兽", "犹", "煜", "碗", "筠", "义", "肄", "莞", "莠", "虞", "蛾", "裕", "诣", "郁", "钰", "雍", "阿", "预", "饮", "衙", "莹", "蓊", "晕", "渥", "琬", "琰", "畹", "筵", "裔", "淡", "催", "传", "勤", "势", "嗣", "塞", "嵩", "厦", "新", "喧", "楸", "楚", "岁湘", "测", "凑", "煦", "琴", "琪", "琦", "睡", "祺", "稔", "稠", "筮", "粲", "绣", "群", "圣", "莎", "裙", "诩", "诗", "试", "诠", "详", "资", "载", "送", "铅", "阻", "雌", "颂", "驰", "熙", "暄", "琼", "塞", "嵩", "想", "桢", "椿", "岁", "渚", "煮", "琛", "庄", "裟", "输", "轼", "幕", "汇", "惶", "挥", "描", "换", "楣", "枫", "湖", "浑", "渺", "涣", "煤烦", "琶", "琥", "盟", "睦", "碑", "禀", "聘", "腑", "荷", "莫", "号", "蜂", "补", "话", "酩", "附", "颁", "饭", "晕", "募", "焕廓", "愧", "沟", "管", "纲", "诰", "闺", "魁", "构", "歌", "恺", "斡", "荣构", "嘏", "通", "连", "这", "甄", "兢", "喜", "团", "图", "奖", "嫡", "对", "僚", "侥屡", "嶂", "崭", "彰", "廖", "熊", "溜", "监", "祯", "种", "端", "箕", "筝", "精", "绿", "紧", "绫", "纶", "置", "璋", "畅", "榔", "糍", "滇", "尔", "莱", "赵", "铬", "领", "瑙", "奁", "闻", "嫣", "愿", "温", "源", "溢", "尔", "瑜", "瑛", "瑗", "玮", "与舞", "苑", "诱", "语", "郢", "银", "摇", "榕", "荣", "温", "荥", "溶", "菸", "菀", "鞅", "瑛", "僖", "逑", "速", "逍", "肾", "寿", "塾", "尘", "嫩", "实", "像", "侨", "岖", "慈滋", "沧", "溶", "溪", "熊", "狮", "瑞", "瑟", "硕", "算", "粹", "绸", "综", "绰", "绮", "翠", "菁", "菜", "菖", "裳", "认", "誓", "诵", "说", "诚", "轻", "菘", "造", "速", "衔", "铨", "限", "需", "韶", "饲", "饰", "旗", "畅", "荣", "榕", "齐", "熏", "僦", "尝", "墅", "奖", "实", "寨", "慎", "准", "溯", "搴", "逢", "梦", "仆", "幕", "滑", "瑚", "珲", "碧", "福", "绵", "翡", "腑", "萍华", "菩", "蜜", "裴", "豪", "宾", "辅", "郝", "铭", "阀", "陌", "颇", "饮", "凤", "鸣", "榜", "槐", "滏宽", "广", "慷", "惯", "概", "瑰", "葛", "葵", "课", "逵", "郭", "稿", "靠溉", "锆", "俭", "著", "价", "厉", "剧", "剑", "刘", "妖", "履", "帜", "弹", "徵", "德虑", "摘", "敌", "整", "暂", "椿", "闾", "乐", "楼", "樟", "滴", "渐", "涨", "浆", "练", "缔", "蒂", "骀", "落", "董", "葶", "蝶", "调", "谆", "谈", "诋", "诤", "谅", "论", "质", "驼", "践", "轮", "逮", "进", "醇", "铝", "阵", "震", "霆", "驾", "驻", "稽", "稻", "稷", "节", "剪", "几", "鲁", "黎", "侬", "涤", "墩", "幢", "嶙", "锻", "褚", "亿", "仪", "影", "慰", "忧", "乐", "样", "欧", "毅", "演", "渔", "熬", "熠熨", "瑶", "缘", "纬", "腰", "万", "莹", "叶", "苇", "谊", "逸", "邮", "阅", "院", "鞍", "颐", "养", "欲", "颍", "粗", "缓", "卫", "葳", "骑", "妩", "鉴", "署", "啸", "增", "婵", "审", "层", "厂", "厨", "厮", "庆", "摧", "数", "枢漆", "熟", "热", "线", "肠", "兴", "萱", "冲", "褚", "谁", "请", "贤", "赏", "赐", "趣", "娴", "醉", "锐", "销", "爽", "霄", "驷", "确", "磁", "穷", "箭", "箱", "竖", "辍", "帜", "漩", "渐", "箴", "节", "绪", "翦", "葸", "诤", "谆", "质", "醇", "罚", "划", "哗", "坟", "墨", "币", "庙", "废", "慧", "慕", "慢", "暮", "樊标", "模", "流", "浒", "汉", "满", "漫", "漂", "玛", "缓", "编", "腹", "铺", "葆", "葡", "复", "卖", "赋", "辉", "辈", "部", "锋", "陛", "盘", "码", "篇", "范", "麾", "劈", "幡", "慧", "摩", "沪", "漠", "磐", "褒", "弼", "荭窥", "糕", "膏", "盖", "钢", "龟", "购", "器", "垦", "横", "橄", "篙", "馆尽", "坛", "导", "惮", "战", "撰", "整", "历", "瞳", "昙", "暨", "机", "橘", "洁", "潭", "灯", "瑾", "璋", "庐", "积", "筑", "蒸", "诸", "", "谛", "诺", "练", "猪", "赖", "蹄", "辑", "道", "达", "都", "录", "锦", "锭", "陆", "陶", "陵", "霓", "霖", "静", "颊", "头", "雕", "疆", "腿", "臻", "赚", "骆", "莅", "俦", "橙", "润", "澈", "笃", "缙", "萤", "卫", "谓", "谒", "谙", "谕", "豫", "逾", "游", "运", "阴", "余", "赢", "蓉", "蓊", "勋", "儒", "器", "学", "宪", "熹", "憧", "晓", "桥", "樵", "橙", "橡", "树润", "潮", "甑", "莳", "璇", "聪", "融", "亲", "谌", "谐", "输", "遂", "醒", "钱", "错", "陈", "陲", "赛", "蓄", "苍", "侪", "澍", "莼", "谊", "铮", "锡", "阊", "桦", "壁", "奋", "播", "抚", "横", "潘", "磨", "蒙", "衡", "谋", "讳", "讽辨", "锚", "陪", "默", "蒲", "蓓", "滨", "嬖", "凭", "颖", "蓉", "运", "阴", "馀恳", "桧", "糠", "馆", "阶", "瞰", "励", "岭", "懂", "挡", "担", "据", "捡", "激", "浓", "烛", "瞳", "璐", "矶磷", "绩", "联", "胶", "膛", "临", "举", "莲", "蔗", "蒋", "讲", "递", "辗", "镀", "锻", "钟", "键", "隆", "队", "骏", "黛", "点", "泽", "沣", "潞", "澄", "优", "婴", "屿", "狱", "赢", "应", "忆", "拥", "澳", "营", "蔚", "荫", "舆锾", "闱", "阳", "偿", "择", "擅", "操", "泽", "澡", "燧", "禧", "穗", "簇", "纵", "总", "聪声", "膝", "襄", "谦", "逮", "邹", "乡", "隋", "虽", "霞", "霜", "鲜", "戏", "鸿", "壕", "嫔", "弥", "帮", "桧", "篷", "缝", "繁", "褒", "锚", "韩", "蔓徵", "擘", "扶", "柜", "圹", "归", "缋", "蒉", "磬", "纩", "戴", "拟", "抬", "挤", "爵", "涛", "礼", "简", "粮", "职", "旧", "蕉", "谨转", "遮", "题", "镇", "储", "藜", "芷", "迟", "鲤", "翼", "芸", "讴", "医", "隘", "额", "瑷", "莸", "镒", "隗", "彝", "潍", "储", "丛", "曙", "湿", "织", "萧", "蕊", "蝉", "适", "双", "绣", "锁垒", "戴", "断", "柠", "涛", "泞", "璐", "礼", "粮", "藜", "槟", "滨", "获", "壁", "环", "蕃", "丰", "庞", "璧", "馥扩", "关", "铿", "庐", "疆", "祷", "荐", "勒", "襟", "谭", "证", "轿", "辽", "邻", "郑", "邓类", "鲸", "丽", "麓", "镜", "觉", "际", "橹", "栎", "泺", "辚", "链", "韵", "稳", "薏", "薇", "膺", "臆", "蚁", "袄", "遗", "雾", "愿", "艳", "蓣蕹", "韫", "玺", "薛", "薪", "绳", "蟹", "识", "赞", "遵", "迁", "选", "庞", "渖", "荐谯", "镟", "锵", "镞", "铲", "际", "颡", "鹑", "暹", "攀", "簿", "绘", "鹏", "庞", "瀑", "宝", "祢", "薜", "谱", "镆", "镘矿", "阚", "岿", "藉", "蓝", "拢", "沥", "泷", "竞", "篮", "罗", "舰", "觉", "警", "钟", "露", "腾", "党", "枥", "槠", "滤", "濑", "炉", "窦", "笞", "筹", "镦", "荩", "严", "瀛", "耀", "译", "议", "邀", "懿", "赢", "萨", "藏", "薰", "壤", "悬", "曦", "琼", "筹", "脐", "馨", "释", "献", "坏", "孀", "籍", "藉", "谵", "锈", "钟", "宝", "怀", "瀚", "缤", "还", "迈", "飘", "膑", "朦", "濒", "铧顾", "钚", "俪", "栏", "铁", "鸡", "镯", "藤", "览", "镭", "铎", "铛", "膑", "丽", "斓", "樱", "艺", "藕", "誉", "跃", "迩", "莺", "险", "续", "随", "属", "攘", "誉", "茑", "鸡", "藩", "轰", "辩", "癖", "霸", "鹤", "钚灌", "垄", "叠", "笼", "听", "芦", "览", "读", "铸", "籁", "苈", "链", "懿", "蔼", "隐", "璎", "蕴", "鳙", "欢", "边", "鳗", "镔", "沣", "镬" };


    public static PlayerHost CreatePlayerHost()
    {

      lock ( globalSyncRoot )
      {
        string name;
        int time =0;
        do
        {

          name = lastNames.RandomItem() + firstNames.RandomItem();
          if ( name.Length < 3 && DateTime.Now.Millisecond % 2 == 1 )
            name += firstNames.RandomItem();


          if ( time++ > 50 )
            throw new InvalidOperationException( "无法找到一个合适的名称" );

        } while ( playerNames.Contains( name ) );


        var instance = new PlayerHost( Guid.NewGuid(), name );
        playerHosts.Add( instance.Guid, instance );
        instance.ShowInitializeInfo();
        return instance;

      }
    }

    private void ShowInitializeInfo()
    {
      this.WriteSystemMessage( "欢迎您参与到通用卡牌游戏引擎实例游戏项目，您在游戏中的名字是 {0}，希望您能喜欢这个名字", Name );
      this.WriteSystemMessage( "通用卡牌游戏引擎可以帮助您快速的构建您想象中的卡牌游戏，其项目通过 Apache 2.0 协议开源。" );
      this.WriteSystemMessage( "项目地址： https://github.com/Ivony/TableGames ，作者： Ivony 。" );
      this.WriteSystemMessage( "特别感谢群友 @谁在秋千 对项目的大力支持和开发的 Web 游戏客户端。" );
      this.WriteSystemMessage( "记得点赞哦，，，，，，" );

    }

    private static object globalSyncRoot = new object();
    private static Hashtable playerHosts = new Hashtable();
    private static HashSet<string> playerNames = new HashSet<string>();


    /// <summary>
    /// 
    /// </summary>
    /// <param name="userId"></param>
    /// <returns></returns>
    public static PlayerHost GetPlayerHost( Guid userId )
    {
      lock ( globalSyncRoot )
      {
        return playerHosts[userId] as PlayerHost;
      }

    }



    /// <summary>
    /// 玩家名称
    /// </summary>
    public string Name
    {
      get;
      private set;
    }



    private static readonly Regex playerNameRegex = new Regex( "^[_a-zA-Z0-9]{3,20}$", RegexOptions.Compiled );

    /// <summary>
    /// 尝试设置玩家名称
    /// </summary>
    /// <param name="name">玩家名称</param>
    public bool TrySetName( string name )
    {
      lock ( globalSyncRoot )
      {
        if ( playerNames.Contains( name ) )
          return false;

        if ( !playerNameRegex.IsMatch( name ) )
          return false;

        playerNames.Remove( Name );
        playerNames.Add( Name = name );
        return false;
      }
    }



    private PlayerConsole _console;

    /// <summary>
    /// 获取玩家控制台，用于给玩家显示消息
    /// </summary>
    public PlayerConsoleBase Console
    {
      get { return _console; }
    }



    /// <summary>
    /// 若已经加入某个游戏，则获取游戏中的玩家对象
    /// </summary>
    public GamePlayer Player { get; private set; }


    GamePlayer IPlayerHost.GetPlayer()
    {
      return Player;
    }

    /// <summary>
    /// 通知玩家已经加入了某个游戏
    /// </summary>
    /// <param name="player"></param>
    public void JoinedGame( GamePlayer player )
    {

      lock ( globalSyncRoot )
      {
        if ( Player != null )
          throw new InvalidOperationException( "玩家当前已经在另一个游戏，无法加入游戏" );

        Player = player;
      }
    }


    /// <summary>
    /// 强行退出某个游戏
    /// </summary>
    public void QuitGame()
    {
      lock ( SyncRoot )
      {
        if ( Player == null )
          throw new InvalidOperationException( "玩家当前未加入任何游戏，无法从游戏中退出" );

        Player.QuitGame();
        Player = null;
      }
    }



    /// <summary>
    /// 获取是否正在游戏
    /// </summary>
    public bool Gaming
    {
      get { return Player != null; }
    }




    /// <summary>
    /// 获取用于同步的对象
    /// </summary>
    public object SyncRoot { get; private set; }


    internal IResponding Responding { get; set; }



    /// <summary>
    /// 获取是否正在等待玩家响应
    /// </summary>
    public bool WaitForResponse
    {
      get { return Responding != null; }
    }



    /// <summary>
    /// 获取输入提示信息，当等待用户响应时，显示该提示信息给用户。
    /// </summary>
    public string PromptText
    {
      get
      {
        lock ( SyncRoot )
        {
          if ( Responding == null )
            return null;

          else
            return Responding.PromptText;
        }
      }
    }


    /// <summary>
    /// 获取需要玩家选择的选项信息（如果有的话）
    /// </summary>
    /// <returns>选项信息</returns>
    public OptionEntity[] GetOptions()
    {
      lock ( SyncRoot )
      {
        var responding = Responding as OptionsResponding;

        if ( responding == null )
          return null;

        return responding.Options.Select( item => new OptionEntity( item ) ).ToArray();
      }
    }



    /// <summary>
    /// 当玩家响应了消息时，调用此方法
    /// </summary>
    /// <param name="message">响应的消息</param>
    internal void OnResponse( string message )
    {

      lock ( SyncRoot )
      {
        if ( Responding == null )
        {
          this.WriteSystemMessage( "未在响应窗口时间或已经超时，无法再接收消息" );
          return;
        }


        Responding.OnResponse( message );
      }
    }





    private class PlayerConsole : PlayerConsoleBase
    {

      public PlayerHost PlayerHost { get; private set; }

      public PlayerConsole( PlayerHost host )
      {
        PlayerHost = host;
      }

      public override void WriteMessage( GameMessage message )
      {
        PlayerHost._messages.Add( message );
      }

      public override async Task<string> ReadLine( string prompt, CancellationToken token )
      {
        return await new TextMessageResponding( PlayerHost, prompt, token ).RespondingTask.ConfigureAwait( false );
      }



      public override async Task<IOption> Choose( string prompt, IOption[] options, CancellationToken token )
      {
        return await new OptionsResponding( PlayerHost, prompt, options, token ).RespondingTask.ConfigureAwait( false );
      }

    }




    private List<GameMessage> _messages = new List<GameMessage>();


    private int index = 0;

    /// <summary>
    /// 设置最后一次收取的消息位置
    /// </summary>
    /// <param name="messageIndex"></param>
    internal void SetMessageIndex( int messageIndex )
    {
      index = messageIndex;
    }


    /// <summary>
    /// 最后一次收取的消息位置
    /// </summary>
    internal int LastMesageIndex
    {
      get { return _messages.Count; }
    }

    public GameMessage[] GetMessages()
    {
      lock ( SyncRoot )
      {
        if ( index > LastMesageIndex )
          return new GameMessage[0];

        return _messages.GetRange( index, LastMesageIndex - index ).ToArray();
      }
    }



    public override string ToString()
    {
      return Guid.ToString();
    }
  }
}
